40 Hole Ball/40/pickleball_40_Test_15_15/Allrun.sh

#!/bin/sh

runApplication surfaceFeatureExtract

runApplication blockMesh

runApplication snappyHexMesh -overwrite

runApplication simpleFoam